package insty.generator;

import java.util.Random;

public class NicknameGenerator {
    private static final String[] ADJECTIVES = {
            "빠른", "큰", "작은", "붉은", "푸른", "하얀", "검은", "귀여운", "씩씩한", "용감한",
            "똑똑한", "친절한", "착한", "밝은", "멋진", "예쁜", "강한", "순한", "따뜻한", "졸린",
            "차가운", "시원한", "고운", "튼튼한", "행복한", "느린", "이쁜", "사나운", "섬세한", "재빠른",
            "다정한", "유쾌한", "온화한", "은은한", "조용한", "활발한", "정직한", "부드러운", "단단한", "기쁜",
            "얌전한", "화려한", "슬픈", "정다운", "깨끗한", "순수한", "명랑한", "까만", "은빛", "작고귀여운",
            "맑은", "불같은", "노란", "기분좋은", "활기찬", "튼튼하고", "꿈꾸는", "재치있는", "열정적인", "단호한",
            "믿음직한", "차분한", "친숙한", "겸손한", "엉뚱한", "성실한", "화난", "졸린", "덜렁대는", "귀찮은",
            "차가운", "생기있는", "씩씩한", "강력한", "까칠한", "설레는", "우아한", "진지한", "신나는", "끈질긴",
            "의젓한", "정겨운", "명석한", "소심한", "정많은", "분주한", "열심히", "어두운", "혼란한", "잘생긴",
            "용맹한", "개성있는", "밝은", "깨방정", "까불까불", "깔끔한", "웃긴", "엉뚱한", "쾌활한", "풍성한"
    };

    private static final String[] ANIMALS = {
            "강아지", "고양이", "호랑이", "사자", "코끼리", "원숭이", "여우", "늑대", "토끼", "곰",
            "판다", "하마", "코뿔소", "기린", "캥거루", "다람쥐", "너구리", "족제비", "돼지", "닭",
            "오리", "기러기", "참새", "펭귄", "부엉이", "수달", "도마뱀", "거북이", "해마", "돌고래",
            "상어", "문어", "가오리", "장어", "낙지", "고래", "멧돼지", "염소", "양", "말",
            "소", "쥐", "개미", "벌", "잠자리", "나비", "매미", "풍뎅이", "두더지", "삵",
            "청설모", "까치", "까마귀", "앵무새", "비둘기", "고라니", "수리부엉이", "딱따구리", "매", "독수리",
            "늑대개", "박쥐", "살모사", "코알라", "라쿤", "다람지", "알파카", "라마", "올빼미", "백조",
            "홍학", "개구리", "두꺼비", "도롱뇽", "가재", "게", "새우", "쏘가리", "잉어", "메기",
            "노루", "산양", "족제비", "담비", "사슴", "기러기", "제비", "직박구리", "황새", "물개",
            "바다표범", "해달", "두루미", "거위", "부엉이", "흰수염고래", "물범", "하이에나", "치타", "재규어"
    };

    private static final Random random = new Random();

    public static String generateNickname() {
        while (true) {
            String adjective = ADJECTIVES[random.nextInt(ADJECTIVES.length)];
            String animal = ANIMALS[random.nextInt(ANIMALS.length)];
            String number = String.format("%03d", random.nextInt(1000));

            String nickname = adjective + animal + number;

            if (nickname.length() <= 10 && adjective.length() <= 3 && animal.length() >= 2 && animal.length() <= 4) {
                return nickname;
            }
        }
    }

}
